; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v9)
             (pred_1 ?v4 ?v10)
             (pred_3 ?v6 ?v10)
             (pred_12 ?v8 ?v6 )
	     (pred_6 ?v6)
             (pred_7 ?v12)
             (pred_9 ?v4)
             (pred_2 ?v10)
             (pred_4 ?v6)
             (pred_10 ?v4)
             (pred_11 ?v6)
             (pred_5 ))



(:action op_3
:parameters (?v3 ?v11 ?v13 ?v5)
:precondition (and (pred_7 ?v3) (pred_7 ?v11) (pred_9 ?v13) (pred_2 ?v5)
          (pred_8 ?v3 ?v11) (pred_1 ?v13 ?v5)
                   (pred_3 ?v11 ?v5) (pred_6 ?v3) 
                   (pred_4 ?v11) (pred_10 ?v13))
:effect (and  (pred_11 ?v11) (not (pred_4 ?v11))))


(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_7 ?v3) (pred_7 ?v7)
               (pred_6 ?v3) (pred_8 ?v3 ?v7) (pred_11 ?v7))
:effect (and (pred_6 ?v7) (not (pred_6 ?v3))))

(:action op_1
:parameters (?v3 ?v13)
:precondition (and (pred_7 ?v3) (pred_9 ?v13) 
                  (pred_6 ?v3) (pred_12 ?v13 ?v3) (pred_5 ))
:effect (and (pred_10 ?v13)
   (not (pred_12 ?v13 ?v3)) (not (pred_5 ))))


(:action op_4
:parameters (?v3 ?v2 ?v1)
:precondition (and (pred_7 ?v3) (pred_9 ?v2) (pred_9 ?v1)
                  (pred_6 ?v3) (pred_10 ?v1) (pred_12 ?v2 ?v3))
:effect (and (pred_10 ?v2) (pred_12 ?v1 ?v3)
        (not (pred_10 ?v1)) (not (pred_12 ?v2 ?v3))))

(:action op_5
:parameters (?v3 ?v13)
:precondition (and (pred_7 ?v3) (pred_9 ?v13) 
                  (pred_6 ?v3) (pred_10 ?v13))
:effect (and (pred_5 ) (pred_12 ?v13 ?v3) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_25 obj_19 obj_15 obj_17 obj_02 obj_08 obj_06 obj_05 obj_23 obj_21 obj_26 obj_11 obj_12 obj_18 obj_27 obj_07 obj_01 obj_03 obj_30 obj_16 obj_22 obj_13 obj_14 obj_10 obj_20
    obj_09 obj_04 obj_24
    obj_29 obj_28 obj_31
    )

    (:init
       (pred_5)

       (pred_7 obj_25)
       (pred_7 obj_19)
       (pred_7 obj_15)
       (pred_7 obj_17)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_7 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_23)
       (pred_7 obj_21)
       (pred_7 obj_26)
       (pred_7 obj_11)
       (pred_7 obj_12)
       (pred_7 obj_18)
       (pred_7 obj_27)
       (pred_7 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_30)
       (pred_7 obj_16)
       (pred_7 obj_22)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_04)
       (pred_2 obj_24)
       (pred_9 obj_29)
       (pred_9 obj_28)
       (pred_9 obj_31)

       (pred_8 obj_25 obj_08)
       (pred_8 obj_25 obj_19)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_25)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_17)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_17 obj_23)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_15)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_25)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_05 obj_23)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_23 obj_18)
       (pred_8 obj_23 obj_21)
       (pred_8 obj_23 obj_17)
       (pred_8 obj_23 obj_05)
       (pred_8 obj_21 obj_27)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_23)
       (pred_8 obj_26 obj_07)
       (pred_8 obj_26 obj_11)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_11 obj_26)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_18 obj_30)
       (pred_8 obj_18 obj_27)
       (pred_8 obj_18 obj_23)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_27 obj_21)
       (pred_8 obj_27 obj_18)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_07 obj_01)
       (pred_8 obj_07 obj_26)
       (pred_8 obj_01 obj_13)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_07)
       (pred_8 obj_03 obj_14)
       (pred_8 obj_03 obj_30)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_30 obj_10)
       (pred_8 obj_30 obj_16)
       (pred_8 obj_30 obj_18)
       (pred_8 obj_30 obj_03)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_16 obj_30)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_01)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_14 obj_10)
       (pred_8 obj_14 obj_03)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_10 obj_20)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_10 obj_14)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_10)
       (pred_4 obj_02)
       (pred_4 obj_22)
       (pred_4 obj_19)
       (pred_3  obj_02 obj_09)
       (pred_3  obj_22 obj_04)
       (pred_3  obj_19 obj_24)
       (pred_11 obj_25)
       (pred_11 obj_15)
       (pred_11 obj_17)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_11 obj_05)
       (pred_11 obj_23)
       (pred_11 obj_21)
       (pred_11 obj_26)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_03)
       (pred_11 obj_30)
       (pred_11 obj_16)
       (pred_11 obj_13)
       (pred_11 obj_14)
       (pred_11 obj_10)
       (pred_11 obj_20)

       (pred_1  obj_29 obj_09)
       (pred_1  obj_28 obj_04)
       (pred_1  obj_31 obj_24)
       (pred_12 obj_29 obj_17)
       (pred_12 obj_28 obj_13)
       (pred_12 obj_31 obj_21)
       (pred_6 obj_03)
    )

    (:goal (and
       (pred_12 obj_28 obj_10)
    ))
(:constraints
  (always (not (pred_6 obj_14)))
)
)

; plan
1. (op_2 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 0 of 1
2. (op_2 obj_01 obj_13)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_28)
   deleted: (pred_12 obj_28 obj_13) (pred_5)
   added: (pred_10 obj_28)
   goals met: 0 of 1
4. (op_2 obj_13 obj_01)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 0 of 1
6. (op_2 obj_03 obj_30)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_30)
   goals met: 0 of 1
7. (op_2 obj_30 obj_10)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_10)
   goals met: 0 of 1
8. (op_5 obj_10 obj_28)
   deleted: (pred_10 obj_28)
   added: (pred_5) (pred_12 obj_28 obj_10)
   goals met: 1 of 1
